Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: You may be able to evaluate multiple commands in a single line by separating them with the command separator character, if your shell supports that (e.g. C<;> on many Unix shells; C<&> on the Windows NT C<cmd> shell).
es_es: Quizás sea capaz de evaluar múltiples comandos en una sola línea, separándoles con el carácter separador de comandos, si el shell lo soporta (por ejemplo, C<;> en muchos shell Unix; C<&> en el shell C<cmd> de Windows NT).

source: 3.14> will not do what you want in scalar context because each of the operands are evaluated using their integer representation.
es_es: 3,14> no harán lo que quiere hacer en contexto escalar porque cada uno de los operandos son evaluados utilizando su representación entera.

source: if ($string =~ /^\d+$/) { ... }
es_es: if ($cadena =~ /^\d+$/) { ... }

source: oct() and hex() in glorious 64 bit
es_es: oct() y hex() en el glorioso mundo de los 64 bits

source: C<Term::ANSIColor> upgraded to version 1.10
es_es: C<Term::ANSIColor> actualizado a la versión 1.10

source: -p File is a named pipe (FIFO), or Filehandle is a pipe.
es_es: -p Archivo es una tubería con nombre (FIFO), o el identificador de archivo es una tubería.

source: return $first; # Or here.
es_es: return $first; # O aquí.

source: See also the C<IPC::SysV> and C<IPC::SysV::Msg> documentation.
es_es: Vea también la documentación de C<IPC::SysV> y C<IPC::SysV::Msg>.

source: The F<Changes> file for an explanation of how to view exhaustive details on what changed.
es_es: El archivo F<Changes> (Cambios) para obtener más información exhaustiva sobre lo que ha cambiado.

source: For example C</foo(?!bar)/> matches any occurrence of "foo" that isn't followed by "bar".
es_es: por ejemplo, C</foo(?!bar)/> coincide con cualquier ocurrencia de "foo" que no esté seguido por "bar".

source: This means that programs that do not also use C<flock> may modify files locked with C<flock>.
es_es: Esto significa que los programas que no usen C<flock> pueden modificar archivos bloqueados con C<flock>.

# return (CR)
source: \r return (CR)
es_es: \r retorno (CR)

source: If you know the exact length in bits, it can be used in place of the C<*>.
es_es: Si conoce la longitud exacta en bits, puede ser utilizada en lugar de la C<*>.

source: Second, references to variables related to output will refer to this output channel.
es_es: En segundo lugar, las referencias a variables relacionadas con la salida se referirán a este canal de salida.

source: # foo eq "AB\0\0CD"
es_es: # foo es "AB\0\0CD"

source: F<xsubpp> is a compiler to convert Perl XS code into C code.
es_es: F<xsubpp> es un compilador que permite convertir código XS de Perl en código C.

source: =head2 Net::Ping 450_service and 510_ping_udp failures
es_es: =head2 Fallos en Net::Ping 450_service y 510_ping_udp

source: by Damian Conway
es_es: Damian Conway

source: B<Text strings>, or B<character strings> are made of characters.
es_es: Las B<cadenas de texto>, o B<cadenas de caracteres>, están constituidas por caracteres.

source: (This is because, as mentioned below, the regex compilation may be done at execution time, and C<\N{...}> is a compile-time construct.)
es_es: (Esto se debe a que, como se menciona más abajo, la compilación de expresiones regulares se puede hacer en tiempo de ejecución, y C<\N{...}> es una construcción en tiempo de compilación).

source: print $logfile $logmessage;
es_es: print $registro $mensaje_registro;

source: perl587delta Perl changes in version 5.8.7
es_es: perl587delta Cambios en la versión 5.8.7

source: (?{ local $cnt = $cnt + 1; # Update $cnt, backtracking-safe.
es_es: (?{ local $cnt = $cnt + 1; # Actualiza $cnt, independiente de si hay que retrotraer.

source: my $price = do { given ($item) {
es_es: my $precio = do { given ($item) {

source: delete $ref->[$x][$y]{$key};
es_es: delete $ref->[$x][$y]{$clave};

source: Typically all the declarations are put at the beginning or the end of the script.
es_es: Típicamente, todas las declaraciones se ponen al comienzo o al final del programa.

source: Perl also defines a consistent extension syntax for features not found in standard tools like B<awk> and B<lex>.
es_es: Perl también define una coherente sintaxis extendida de características no encontradas en las herramientas estándar, como B<awk> y B<lex>.

source: # a run-time error
es_es: # un error en tiempo de ejecución

source: Previous steps were performed during the compilation of Perl code, but this one happens at run time, although it may be optimized to be calculated at compile time if appropriate.
es_es: Pasos previos se realizaron durante la compilación de código Perl, pero éste sucede en tiempo de ejecución, aunque puede ser optimizado para ser valorado en tiempo de compilación, si procede.

source: start of the innermost ()-group.
es_es: inicio del grupo () más interno.

source: It allows programmers to be B<lazy> and to code in a style with which they are comfortable.
es_es: Permite a los programadores ser B<perezosos> y codificar en el estilo en que se encuentran más cómodos.

source: There is one new feature deprecation.
es_es: Hay una nueva característica desaprobada.

source: # __DIE__ hooks may modify error messages
es_es: # llamadas __DIE__ pueden modificar los mensajes de error

source: Most of the time, the longest possible text that does not include spaces between components and which contains matching braces or brackets.
es_es: La mayoría de las veces, el texto más largo posible que no incluya espacios entre los componentes y que contenga un juego de llaves o corchetes.

source: scalar(@whatever) == $#whatever - $[ + 1;
es_es: scalar(@loquesea) == $#loquesea - $[ + 1;

source: @a = @b || @c; # this is wrong
es_es: @a = @b || @c; # esto es un error

source: perluts - Perl under UTS
es_es: perluts - Perl bajo UTS

source: You may find it helpful to use letter case to indicate the scope or nature of a variable.
es_es: Puede encontrar útil usar el tamaño de caja de las letras para indicar el ámbito o naturaleza de una variable.

source: From this we can determine that Perl is different things to different people, but that lots of people think it's at least worth writing about.
es_es: Esto refleja el hecho de que, aunque Perl tiene muchos públicos distintos, muchas personas piensan que merece la pena escribir sobre este lenguaje.

source: open($handle, "<", "myfile") or die "myfile: $!";
es_es: open($handle, "<", "miarchivo") or die "miarchivo: $!";

source: >= greater than or equal
es_es: >= mayor o igual que

source: Since the 5.000 release, we have averaged only about one production release per year.
es_es: Desde el lanzamiento de la versión 5.000 no hemos lanzado más de una versión de producción al año (en promedio).

source: After C<each> has returned all entries from the hash or array, the next call to C<each> returns the empty list in list context and C<undef> in scalar context.
es_es: Después de que C<each> haya devuelto todas las entradas del hash o del array, la siguiente llamada a C<each> devuelve la lista vacía en contexto lista y C<undef> en contexto escalar.

source: perl5139delta Perl changes in version 5.13.9
es_es: perl5139delta Cambios en la versión 5.13.9

source: Beware that if you put literal backslashes (those not inside interpolated variables) between C<\Q> and C<\E>, double-quotish backslash interpolation may lead to confusing results.
es_es: Tenga en cuenta que si pone contrabarras literales (no dentro delas variables interpoladas) entre C<\Q> y C<\E>, una interpolación con doble escapado de contrabarras puede llevar a resultados confusos.

source: # do something
es_es: # hacer algo

source: These have all been fixed.
es_es: Han sido todos corregidos.

source: Double quotes indicate that the text will be interpolated using exactly the same rules as normal double quoted strings.
es_es: Las dobles comillas indican que el texto será interpolado usando exactamente las mismas reglas que las cadenas con dobles comillas.

source: %i a synonym for %d
es_es: %i un sinónimo para %d

source: -s($file) + 1024 # probably wrong; same as -s($file + 1024)
es_es: -s($archivo) + 1024 # probablemente mal; lo mismo que -s($archivo + 1024)

source: Leading white space is ignored without warning, as too are any trailing non-digits, such as a decimal point (C<oct> only handles non-negative integers, not negative integers or floating point).
es_es: El espacio en blanco que le rodea es ignorado sin avisar, como también cualquier otro carácter que no sea un dígito, como un punto decimal (C<oct> sólo maneja números enteros no negativos, no enteros negativos o en punto flotante).

source: This string is true in boolean context and C<0> in numeric context.
es_es: Esta cadena es verdadero en contexto booleano y C<0> en contexto numérico.

source: Detached threads aren't supported on Windows yet, as they may lead to memory access violation problems.
es_es: Hilos independientes todavía no son compatibles con Windows, ya que pueden provocar problemas de violación de acceso a memoria.

source: perluts Perl notes for UTS
es_es: perluts Notas para UTS

source: Summing up, Perl numeric values can store only those numbers which have a finite decimal expansion or a "short" binary expansion.
es_es: En resumen, en Perl los valores numéricos solo pueden almacenar números que tengan una expansión decimal finita o una expansión binaria "corta".

source: if ( /(.*)(\d*)/ ) { # Wrong!
es_es: if ( /(.*)(\d*)/ ) { # ¡Incorrecto!

source: Ignore the warning.
es_es: No haga caso de la advertencia.

source: is exactly equivalent to
es_es: es exáctamente equivalente a

source: perl progname.pl
es_es: perl nombre_programa.pl

source: Code executed that has side effects may not perform identically from version to version due to the effect of future optimisations in the regex engine.
es_es: Código ejecutado que tenga efectos colaterales puede quizás no funcionar de forma idéntica en sucesivas versiones debido a los efectos de futuras optimizaciones en el motor de expresiones regulares.

source: A correct CPAN version number is a floating point number with at least 2 digits after the decimal.
es_es: Un número correcto de versión en CPAN es un número de punto flotante con al menos dos dígitos después del decimal.

source: For example in C<\x{...}>, regardless of the C</x> modifier, there can be no spaces.
es_es: Por ejemplo, en C<\x{...}>, independientemente del modificador C</x>, no puede tener espacios.

source: The returned values are copies of the original keys in the hash, so modifying them will not affect the original hash.
es_es: Los valores devueltos son copias de las claves originales en el hash, así que modificarlas no afectará al hash original.

source: This is the "branch reset" pattern, which has the special property that the capture groups are numbered from the same starting point in each alternation branch.
es_es: Este es el patrón "reinicio de rama", que tiene la propiedad especial de numerar los grupos de captura desde el mismo punto inicial en cada rama de la alternancia.

source: On a Unix-like system, these documentation files will usually also be available as manpages for use with the F<man> program.
es_es: En un sistema Unix, esta documentación estará también disponible, por lo general, en forma de páginas de manual que se pueden consultar con el programa F<man>.

source: In the following table, a C<{}> represents any pair of delimiters you choose.
es_es: En la siguiente tabla, un C<{}> representa cualquier par de delimitadores que usted elija.

source: If you find what you think is a bug, you might check the articles recently posted to the comp.lang.perl.misc newsgroup and the perl bug database at http://bugs.perl.org/ . There may also be information at http://www.perl.com/ , the Perl Home Page.
es_es: Si encuentra algo que piensa que es un error, debe revisar los artículos publicados recientemente en el grupo de noticias comp.lang.perl.misc y la base de datos de errores de perl en http://bugs.perl.org/ . Hay también información en la página principal de Perl, http://www.perl.org/ .

source: use 5.014; # for hh/j/t/z/ printf modifiers
es_es: use 5.014; # para los modificadores hh/j/t/z/ en printf

source: The "const in void context" warning has been suppressed for a constant in an optimised-away boolean expression such as C<5 || print;>
es_es: La advertencia "I<const in void context> (constante en contexto vacío)" ha sido suprimida de las expresiones booleanas optimizadas, como en C<5 || print;>

source: (But the empty C<package;> is no longer supported, as of version 5.10.) X<__FILE__> X<__LINE__> X<__PACKAGE__> X<line> X<file> X<package>
es_es: (Pero el C<package;> vacío ya no está soportado, a partir de la versión 5.10.) X<__FILE__> X<__LINE__> X<__PACKAGE__> X<line> X<file> X<package> X<línea> X<archivo> X<paquete>

source: No idea how to fix this.
es_es: No tengo idea de cómo solucionar este problema.

source: Setting a hash element to the undefined value does not remove its key, but deleting it does; see L</exists>.
es_es: Poner un elemento hash al valor indefinido no elimina su clave, pero eliminándolo sí que lo hace; vea L</exists> .

source: This form of subroutine call is deprecated.
es_es: Esta forma de llamada de subrutina ha sido depreciada.

source: In fact, it's exactly the same as C<||>, except that it tests the left hand side's definedness instead of its truth.
es_es: De hecho, es exactamente lo mismo que C<||>, excepto que comprueba la definición del lado izquierdo en lugar de su estado de verdad.

source: =item unlink LIST X<unlink> X<delete> X<remove> X<rm> X<del>
es_es: =item unlink LISTA X<unlink> X<delete> X<remove> X<rm> X<del> X<elimina> X<borra>

source: You can avoid this problem by using C<pipe> instead.
es_es: Puede evitar este problema mediante el uso, en su lugar, de C<pipe>.

source: With the C<m> you can use any pair of non-whitespace (ASCII) characters as delimiters.
es_es: Con la C<m> puede usar cualquier par de caracteres no-blancos (ASCII) como delimitadores.

# // die "You're homeless! ";
source: // die "You're homeless!\n";
es_es: // die "¡Eres un sintecho!\n";

source: If CMD is IPC_STAT or GETALL, then ARG must be a variable that will hold the returned semid_ds structure or semaphore value array.
es_es: Si CMD es IPC_STAT o GETALL, entonces ARG debe ser una variable que contendrá la estructura semid_ds devuelta o el array de semáforos.

source: See the example under C<die>.
es_es: Ver ejemplo en C<die>.

source: When in doubt, use C<*FH>.
es_es: En caso de duda, use C<*FH>.

source: Note that C<exec> will not call your C<END> blocks, nor will it invoke C<DESTROY> methods on your objects.
es_es: Note que C<exec> no llamará a sus bloques C<END>, ni llamará a ningún método C<DESTROY> de sus objetos.

source: The variables are thousands of characters long and you know that they don't change, and you need to wring out the last little bit of speed by having Perl skip testing for that.
es_es: Las variables tienen miles y miles de caracteres de longitud y sabe que no cambiarán, y necesita exprimir hasta la última gota de la velocidad de Perl, obviando estas pruebas.

source: perlrun Perl execution and options
es_es: perlrun Ejecución y opciones de ejecución

source: This warning is now emitted in more consistent cases; in short, when one of the declarations involved is a C<my> variable:
es_es: Esta advertencia es ahora emitida en casos más consistentes; en resumen, cuando una de las declaraciones en cuestión es una variable C<my>:

source: =item use Module VERSION
es_es: =item use Módulo VERSIÓN

source: The results follow ASCII semantics.
es_es: Los resultados siguen la semántica ASCII.

source: Note that splitting an EXPR that evaluates to the empty string always returns the empty list, regardless of the LIMIT specified.
es_es: Tenga en cuenta que la división de una EXPR que evalúe a una cadena vacía siempre devuelve una lista vacía, sin importar el LÍMITE especificado.

source: Because each operand is evaluated in integer form, C<2.18 ..
es_es: Debido a que cada operando es evaluado en forma de número entero, C<2,18 ..

source: Initially, you write something like this:
es_es: En un principio, escribirá algo como esto:

source: Avoid statements like:
es_es: Evite instrucciones como:

source: is equivalent to the following Perl-like pseudo code:
es_es: es equivalente al siguiente pseudo código Perl:

source: sub fp_equal {
es_es: sub fp_igual {

source: Creates the directory specified by FILENAME, with permissions specified by MASK (as modified by C<umask>).
es_es: Crea el directorio especificado por el nombre de ARCHIVO, con permisos especificados por la MÁSCARA (y modificada por C<umask>).

source: Names that start with a digit may contain only more digits.
es_es: Los nombres que comienzan con un dígito, solo pueden contener más dígitos.

source: Each attempt to access pseudo-hashes will trigger the warning C<Pseudo-hashes are deprecated>.
es_es: Cada intento de acceso a los pseudo-hashes activará la alerta C<Pseudo-hashes are deprecated>.

source: -W File is writable by real uid/gid.
es_es: -W Archivo es escribible por el uid/gid real.

source: my $substring = 'quick.*?fox';
es_es: my $subcadena = 'rápido.*?zorro';

source: On a text string, you would do things like:
es_es: Con una cadena de texto puede realizar operaciones como estas:

source: C<SDBM_File> upgraded to version 1.05
es_es: C<SDBM_File> actualizado a la versión 1.05

source: Binary "." concatenates two strings.
es_es: Binario "." concatena dos cadenas.

source: So how come you can write these:
es_es: Así que ¿cómo entonces puede escribir lo siguiente

source: If it returns a true value, then no objects of that class will be cloned.
es_es: Si devuelve un valor verdadero, entonces ningún objeto de esa clase se clonará.

source: Note also that the interpolation code needs to make a decision on where the interpolated scalar ends.
es_es: Tenga en cuenta también que el código de interpolación tiene que tomar una decisión sobre dónde termina el escalar interpolado.

source: =item qx/STRING/ X<qx> X<`> X<``> X<backtick>
es_es: =item qx/CADENA/ X<qx> X<`> X<``> X<backtick> X<comilla invertida>

source: printf '<%.*s>', 7, "string"; # prints "<string>"
es_es: printf '<%.*s>', 7, "cadena"; # imprime "<cadena>"

source: push @INC, \&my_sub;
es_es: push @INC, \&mi_sub;

source: .23E-10 # a very small number
es_es: .23E-10 # un número muy pequeño

source: See also L<perlnewmod>.
es_es: Vea también L<perlnewmod>.

source: If the PATTERN evaluates to the empty string, the last I<successfully> matched regular expression is used instead.
es_es: Si el PATRÓN se evalúa como la cadena vacía, es usada en su lugar la última I<exitosa> expresión regular coincidente.

source: =item name
es_es: =item nombre

source: LICENSING =========
es_es: LICENCIAS =========

source: =head2 Get your book listed
es_es: =head2 Cómo incluir su libro en la lista

source: which makes the intention more clear.
es_es: lo que hace más clara nuestras intenciones.

source: C<use strict 'refs'> forbids such practice.
es_es: C<use strict 'refs'> prohíbe tal práctica.

source: The behaviour is determined by the following table: the first row that applies determines the match behaviour (which is thus mostly determined by the type of the right operand).
es_es: El comportamiento está determinado por la siguiente tabla: la primera fila que se pueda aplicar determina el comportamiento de la coincidencia (que principalmente está determinado por el tipo del operando derecho).

source: modulo (%) preserving 64-bit integers
es_es: módulo (%) preserva los enteros de 64 bits

source: by Larry Wall, Tom Christiansen, and Jon Orwant
es_es: Larry Wall, Tom Christiansen y Jon Orwant

source: For instance:
es_es: Por ejemplo:

source: See also L<perlport> for notes on the portability of C<select>.
es_es: Vea también L<perlport> para las notas sobre la portabilidad de C<select>.

source: For instance,
es_es: Por ejemplo,

source: =item Look-Around Assertions X<look-around assertion> X<lookaround assertion> X<look-around> X<lookaround>
es_es: =item Aserciones cercanas X<aserciones cercanas> X<aserción cercana> X<cercano> X<cercana>

source: {bar} # with bar.
es_es: {bar} # por bar.

source: You'll have to negotiate C<$|> on your own, though.
es_es: Aunque, tendrá que negociar también con C<$|>.

source: CPAN, or the Comprehensive Perl Archive Network ( http://www.cpan.org/ ), is a replicated, worldwide repository of Perl software.
es_es: CPAN, o Comprehensive Perl Archive Network ( http://www.cpan.org/ ), es un repositorio de software Perl replicado en todo el mundo.

source: and it should output
es_es: y debe de salir

source: The Perl debugger (F<lib/perl5db.pl>) has now been extensively documented and bugs found while documenting have been fixed.
es_es: El depurador de Perl (F<lib/perl5db.pl>) ha sido ampliamente documentado y los errores encontrados, mientras que la documentación se ha fijado.

source: LABEL BLOCK continue BLOCK
es_es: ETIQUETA BLOQUE continue BLOQUE

source: SHIFT this
es_es: SHIFT este

source: All variables and arrays beginning with one of those letters are reset to their pristine state.
es_es: Todas las variables y arrays que comiencen con una de esas letras son restablecidas a su estado prístino.

source: Note that C<glob> splits its arguments on whitespace and treats each segment as separate pattern.
es_es: Tenga en cuenta que C<glob> divide sus argumentos por los espacios en blanco y trata a cada segmento como patrones independientes.

source: Note, however, that this does not always work for quoting Perl code:
es_es: Nótese, sin embargo, que esto no siempre funciona para entrecomillar código Perl:

source: close ARGV if eof; # Not eof()!
es_es: close ARGV if eof; # ¡No eof()!

source: statements;
es_es: instrucciones;

source: $AoA[$i] = [ somefunc($i) ];
es_es: $AoA[$i] = [ algunafuncion($i) ];

source: These differ in their precedence relationship with a following comma.
es_es: Difieren en su relación de precedencia cuando son seguidos por una coma.

source: New utilities: refaddr, isvstring, looks_like_number, set_prototype.
es_es: Nuevas utilerías: refaddr, isvstring, looks_like_number, set_prototype.

source: Do case-insensitive pattern matching.
es_es: Hace coincidencia de patrones sin importar si son mayúsculas o minúsculas.

source: If there is only one scalar argument, the argument is checked for shell metacharacters, and if there are any, the entire argument is passed to the system's command shell for parsing (this is C</bin/sh -c> on Unix platforms, but varies on other platforms).
es_es: Si sólo hay un argumento escalar, se comprueba si el argumento tiene metacaracteres, y si hay alguno, el argumento entero es pasado al shell de comandos para que sea interpretado (suele ser C</bin/sh -c> en plataformas Unix, pero varía en otras plataformas).

source: Tests for regex related functions or behaviour.
es_es: Pruebas de funciones o comportamientos relacionados con expresiones regulares

source: This might as well break the build, though.
es_es: Esto, sin embargo, también podría romper la compilación.

source: The old semantics of this switch only made sense in Win32 and only in the "use utf8" universe in 5.6.x releases, and do not make sense for the Unicode implementation in 5.8.0.
es_es: La semántica anterior de esta opción sólo tiene sentido en Win32 y sólo con "use utf8" en el universo de versiones 5.6.x, y no tienen sentido para la implementación de Unicode en 5.8.0.

source: In list context, a list of values is returned, one per line of output.
es_es: En contexto de lista, se devuelve una lista de valores, uno por cada línea de la salida.

source: And now some examples as a list operator:
es_es: Y ahora algunos ejemplos como un operadores de lista:
